cf_billing/Documents/энргИстечениеДатыПоверкиПУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИстечениеДатыПоверкиПУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргДатыПоверкиПрибораУчета</xr:Item>
				<xr:Item>InformationRegister.энргПриборыУчетаСИстекшимСрокомПоверки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоверкиСчетчика</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МежповерочныйИнтервал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргИстечениеДатыПоверкиПУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргКарточкаАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Карточка абонента'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";	
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.Рассчитать;
	//
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
	
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 Булево - Ложь, функция не работает.
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	Схема 				= Неопределено;
	
	ДобавитьТекстЗапросаПриборыУчетаСИстекшимСрокомПоверки(Схема,Регистры);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
			
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);	
	ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема);
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияЛицевойСчетЗакрыт 			= НСтр("ru = 'На дату операции лицевой счет закрыт'");
	ДанныеСтроения 								= ДополнительныеСвойства.ДанныеСтроения;
	
	ПараметрыЗапроса 							= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 						ДокументСсылка);
	ПараметрыЗапроса.Вставить("ЧастныйСектор",						ДанныеСтроения.ЧастныйСектор);
	ПараметрыЗапроса.Вставить("Строение", 							ДанныеСтроения.Строение);
	ПараметрыЗапроса.Вставить("ТекстСообщенияЛицевойСчетЗакрыт", 	ТекстСообщенияЛицевойСчетЗакрыт);
	
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 			энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 			КлючиТаблицКонтроля);
	
КонецПроцедуры

Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;                  	
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета, ПриборУчета","СрокПоверкиИстек"));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема, ВыбираемыеТаблицы) Экспорт	
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовИстечениеДатыПоверкиПУ";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамИстечениеДатыПоверкиПУ());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());				
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерефейса_Проведение

Процедура ДобавитьТекстЗапросаПриборыУчетаСИстекшимСрокомПоверки(Схема, Регистры)
	
	ИмяРегистра = "энргПриборыУчетаСИстекшимСрокомПоверки";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ФактическаяДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.ФактическаяДатаПоверки, ГОД, ЕСТЬNULL(энргМаркиПриборовУчета.МежповерочныйИнтервал, 0)) КАК ДатаИстеченияПоверки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочек.ПриборУчета КАК ПриборУчета,
	|		ТаблицаТочек.ДатаПоверкиСчетчика КАК ФактическаяДатаПоверки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета
	|	ИЗ
	|		Документ.энргИстечениеДатыПоверкиПУ КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИстечениеДатыПоверкиПУ.ТочкиУчета КАК ТаблицаТочек
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|				ПО ТаблицаТочек.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|			ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (ТаблицаТочек.Ссылка В (&мДокументы))
	|				И (НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргМаркиПриборовУчета КАК энргМаркиПриборовУчета
	|			ПО энргТипыПриборовУчета.МаркаПУ = энргМаркиПриборовУчета.Ссылка
	|		ПО ВложенныйЗапрос.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтрейфеса_КонтрольПроведения

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргУстановитьДатуПоверкиПУ.Ссылка КАК Ссылка,
	|	энргУстановитьДатуПоверкиПУ.Организация КАК Организация,
	|	энргУстановитьДатуПоверкиПУ.Район КАК Район,
	|	энргУстановитьДатуПоверкиПУ.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА &ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяСсылка)
	|		ИНАЧЕ &Строение
	|	КОНЕЦ КАК МКД,
	|	ВЫБОР
	|		КОГДА НЕ энргУстановитьДатуПоверкиПУ.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргУстановитьДатуПоверкиПУ.ДатаФактическогоСобытия
	|		ИНАЧЕ энргУстановитьДатуПоверкиПУ.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргУстановитьДатуПоверкиПУ КАК энргУстановитьДатуПоверкиПУ
	|ГДЕ
	|	энргУстановитьДатуПоверкиПУ.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,Абонент","Организация","Район","Абонент")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеЛС.СостояниеЛицевогоСчета(Схема,ПараметрыСостоянияМКД,"СостояниеЛицевогоСчета");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияЛицевойСчетЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеЛицевогоСчета КАК СостояниеЛицевогоСчета
	|		ПО ПараметрыКонтроля.Организация = СостояниеЛицевогоСчета.Организация
	|			И ПараметрыКонтроля.Район = СостояниеЛицевогоСчета.Район
	|			И ПараметрыКонтроля.Абонент = СостояниеЛицевогоСчета.Абонент
	|ГДЕ
	|	НЕ ПараметрыКонтроля.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|	И (НЕ ЕСТЬNULL(СостояниеЛицевогоСчета.Состояние, ЛОЖЬ)
	|			ИЛИ ПараметрыКонтроля.Период < ЕСТЬNULL(СостояниеЛицевогоСчета.Период, ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеЛС";
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодыми

Функция ТекстДляПроведенияПоСтабильнымПериодамИстечениеДатыПоверкиПУ()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ИСТИНА КАК СрокПоверкиИстек
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИстечениеДатыПоверкиПУ.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочкиУчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИстечениеДатыПоверкиПУ КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка";
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
